Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Except for its lower precedence, this is the same as the ! operator.
ja: 優先順位が低いことを除けば、これは!演算子と同様である。

source: Except when the tilde prefix is used, if both a key-down and a key-up hotkey are defined for a custom modifier key, they will both fire when the key is released.
ja: チルダ接頭辞が使われている場合を除き、カスタム修飾キーにキーダウンホットキーとキーアップホットキーの両方が定義されている場合、キーが離されたときに両方が発火することになります。

source: Except where noted below, any blank value (empty string) or non-numeric value involved in a math operation is not assumed to be zero.
ja: 以下に記す場合を除き、空白の値（空文字列）または数値以外の値が算術演算に含まれる場合、ゼロとはみなされません。

source: Except where noted, each event is limited to one thread at a time, per object.
ja: 注意書きがある場合を除き、各イベントは1つのオブジェクトにつき1スレッドずつに制限されています。

source: Except where noted, these variables are read-only; that is, their contents cannot be directly altered by the script.
ja: 注意書きがある場合を除き、これらの変数は読み取り専用です。つまり、スクリプトでその内容を直接変更することはできません。

source: Exception (use Error or an appropriate subclass)
ja: Exception（Errorまたは適切なサブクラスを使用）

source: Exception handling:
ja: 例外処理：

source: Exception objects thrown by runtime errors can now be identified as instances of the new Error class or a more specific subclass.
ja: ランタイムエラーが投げる例外オブジェクトは、新しいErrorクラスまたはより具体的なサブクラスのインスタンスとして識別できるようになりました。

source: Exceptions are thrown for some errors that weren't previously detected, and some conditions that were incorrectly marked as errors (previously by setting ErrorLevel) were fixed.
ja: 以前は検出されなかったいくつかのエラーに対して例外がスローされ、（以前はErrorLevelの設定によって）誤ってエラーとしてマークされていたいくつかの条件が修正されました。

source: Exceptions thrown by the Else statement are not handled by its associated Try statement, but may be handled by an enclosing Try statement.
ja: Else文でスローされた例外は、関連するTry文では処理されませんが、それを囲んでいるTry文によって処理される場合があります。

source: Excluded because they are not input-capable:
ja: 入力可能でないため除外：

source: Excluded because they are not input-capable: Text, Pic, GroupBox, Button, Progress, Link, StatusBar.
ja: 入力可能でないため除外：Text、Pic、GroupBox、Button、Progress、Link、StatusBar。

source: Excluding tabs and spaces,
ja: タブ、スペースは除く。

source: Excluding tabs and spaces, /* must appear at the start of the line, while */ can appear only at the start or end of a line.
ja: タブ、スペースは除く。/* は行頭に表示する必要があります。 */は、行頭または行末にのみ表示することができます。

source: Excluding the above case, if any invalid options are present, a load-time error is displayed instead of ignoring the invalid options.
ja: 上記の場合を除き、無効なオプションが存在する場合、無効なオプションを無視するのではなく、ロードタイムエラーを表示します。

source: Executable code includes functions, assignments, expressions and blocks, but not directives, labels, hotkeys or hotstrings.
ja: 実行可能コードには、関数、代入、式、ブロックが含まれるが、ディレクティブ、ラベル、ホットキー、ホットストリングは含まれない。

source: Execute
ja: 実行

source: Execute.
ja: 実行

source: Executes one case from a list of mutually exclusive candidates.
ja: 相互に排他的な候補のリストから1つのケースを実行します。

source: Executes some code if a loop had zero iterations.
ja: ループの繰り返し回数が0回だった場合に、何らかのコードを実行します。

source: Executes the given code as a new AutoHotkey process.
ja: 与えられたコードを新しいAutoHotkeyのプロセスとして実行します。

source: Exempts subsequent hotkeys and hotstrings from suspension.
ja: 後続のホットキーや ホットストリングを 停止対象から除外します。

source: Exists Since
ja: 初出のWindowsバージョン

source: Exit - Exit the script.
ja: Exit - スクリプトを終了します。

source: Exit - Syntax & Usage | AutoHotkey v2
ja: Exit - 構文と使用法｜AutoHotkey v2

source: Exit ; Terminate this function as well as the calling function.
ja: Exit ; 呼び出した関数と同様に、この関数も終了させる。

source: Exit: Continuation not supported.
ja: Exit：コンティニュアスには対応していません。

source: ExitApp - Syntax & Usage | AutoHotkey v2
ja: ExitApp - 構文と使用法｜AutoHotkey v2

source: ExitApp ; This line will not execute until the user unpauses the script.
ja: ExitApp ; この行はユーザーがスクリプトの一時停止を解除しない限り実行されません。

source: ExitApp is often unnecessary in scripts which are not persistent.
ja: ExitAppは、永続的でないスクリプトでは不要なことが多い。

source: ExitApp: This is a critical error.
ja: ExitApp：これは致命的なエラーです。

source: Exits (terminates) any type of loop statement.
ja: あらゆるタイプのループ文から抜け出します（終了します）。

source: Exits the current thread.
ja: 現在のスレッドを終了します。

source: Expand the Tools entry.
ja: ツールの項目を展開します。

source: Expand the wm_command messages that've accumulated (forget others if any).
ja: 溜まっているwm_commandメッセージを展開する（もしあれば他のものは忘れる）。

source: Explicit concatenation:
ja: 明示的な連結：

source: Explicit concatenation: "The value is " . MyVar
ja: 明示的な連結："The value is " . MyVar

source: Explicit declarations always take precedence over local variables of the function which encloses them.
ja: 明示的な宣言は、それを包含する関数のローカル変数よりも常に優先されます。

source: Explicitly use the ".exe" extension.
ja: 明示的に拡張子「.exe」を使用します。

source: Explicitly use the full path of wordpad.exe.
ja: wordpad.exeのフルパスを明示的に使用します。

source: Expression Evaluation
ja: 式評価

source: Expression Operators (in descending precedence order)
ja: 式演算子（優先順位の降順）

source: Expression Statements
ja: 表現文

source: Expression evaluation can only be performed by the script's main thread (at the OS level, not a quasi-thread), not directly by the keyboard/mouse hook.
ja: 式の評価は、スクリプトのメインスレッド（OSレベルで、準スレッドではない）でしか行えず、キーボード/マウスフックで直接行うことはできません。

source: Expressions
ja: 式

source: Expressions (Math etc.)
ja: 式（数学など）

source: Expressions are used to perform one or more operations upon a series of variables, literal strings, and/or literal numbers.
ja: 式は、一連の変数、リテラル文字列、リテラル数値に対して、演算を実行するために使用されます。

source: Expressions can be written in command format, e.g.
ja: 式はコマンド形式で書くことができる。

source: Expressions starting with (.
ja: 始まる表現(。

source: Expressions starting with a double-deref, such as %varname% := 1.
ja: %varname% := 1のように、ダブルデフで始まる式。

source: Expressions that start with any of those described above (but not those described below) are also allowed, for simplicity.
ja: 簡略化のため、上記のいずれかで始まる表現（後述のものは除く）も可とします。

source: ExtID := 0 ; Initialize to handle extensions that are shorter than others.
ja: ExtID := 0 ; 他より短い拡張子を扱うために初期化する。

source: ExtID := FileExt ; Special ID as a placeholder.
ja: ExtID := FileExt ; プレースホルダーとしての特別なIDです。

source: Extended List-View Styles.
ja: 拡張List-Viewスタイルを参照。

source: Extended Style
ja: 拡張スタイル

source: Extended Usage
ja: 延長使用

source: External functions that reside in DLL files may be called with DllCall.
ja: DLLファイルに存在する外部関数は、DllCallで呼び出すことができる。

source: External scripts and alternative embedded scripts can be executed by using the /script switch.
ja: 外部スクリプトおよび代替埋め込みスクリプトは、/scriptスイッチを使用して実行することができます。

source: Extracts the individual control names from the active window's control list.
ja: アクティブウィンドウのコントロールリストから個々のコントロール名を抽出する。

source: Extracts the individual rows and fields out of a ListView.
ja: ListViewから個々の行とフィールドを抽出します。

source: F = Include files.
ja: F = インクルードファイル。

source: FAQ:
ja: よくある質問

source: FAQ: My antivirus program flagged AutoHotkey or a compiled script as malware.
ja: よくある質問：アンチウイルスプログラムがAutoHotkeyやコンパイルされたスクリプトをマルウェアと判定しました。

source: FILE_SHARE_READ := 0x1 ; This and the next are whether other processes can open the file while we have it open.
ja: FILE_SHARE_READ := 0x1 ; こちらがファイルを開いている間に、他のプロセスがファイルを開くことができるかどうかです。

source: Failure to allocate memory for a built-in function's return value, concatenation or the expression's result.
ja: 組み込み関数の戻り値、連結、または式の結果のためのメモリ割り当てに失敗します。

source: Failure to execute a dynamic function call or method call.
ja: 動的な関数呼び出しやメソッド呼び出しの実行に失敗した場合。

source: False if there are any digits, spaces, tabs, punctuation, or other non-alphabetic characters anywhere in the string.
ja: 文字列のどこかに数字、空白、タブ、句読点、その他の非アルファベット文字がある場合は偽とします。

source: False if there are any digits, spaces, tabs, punctuation, or other non-lowercase characters anywhere in the string.
ja: 文字列のどこかに数字、空白、タブ、句読点、その他の小文字以外の文字がある場合は偽とします。

source: False if there are any digits, spaces, tabs, punctuation, or other non-uppercase characters anywhere in the string.
ja: 文字列のどこかに数字、空白、タブ、句読点、その他の大文字でない文字がある場合は、偽とします。

source: False positives might be more common for compiled scripts which have been compressed, such as with UPX (default for AutoHotkey 1.0 but not 1.1) or MPRESS (optional for AutoHotkey 1.1).
ja: UPX（AutoHotkey 1.0のデフォルト、1.1は不可）やMPRESS（AutoHotkey 1.1のオプション）など、圧縮されているコンパイル済みスクリプトでは、誤検出がより一般的になるかもしれません。

source: Fast vs. Slow
ja: 高速と低速の比較

source: Fast-forward 5 seconds
ja: 5秒早送り

source: Fat Arrow Properties
ja: ファット・アロー・プロパティーズ

source: Fat arrow syntax can also be used to define shorthand properties and methods.
ja: ファット・アロー構文は、省略記法のプロパティや メソッドを定義するためにも使用できます。

source: Favorites
ja: お気に入り

source: Features:
ja: 特徴：

source: Feedback is welcome!
ja: フィードバックは大歓迎だ！

source: Fewer VK to SC and SC to VK mappings are hard-coded, in theory improving compatibility with non-conventional custom keyboard layouts.
ja: VKからSC、SCからVKへのマッピングがハードコードされることが少なくなり、理論上、従来とは異なるカスタムキーボードレイアウトとの互換性が向上しています。

source: File Must Exist
ja: ファイルが存在する必要がある

source: File Object
ja: Fileオブジェクト

source: File Object - Methods & Properties | AutoHotkey v2
ja: Fileオブジェクト - メソッドとプロパティ｜AutoHotkey v2

source: File functions which previously stored the number of failures in ErrorLevel now throw it in the Extra property of the thrown exception object.
ja: これまでErrorLevelに失敗の回数を格納していたファイル関数は、投げられた例外オブジェクトのExtraプロパティにその回数を格納するようになりました。

source: File objects also support binary I/O via RawWrite/RawRead or WriteNum/ReadNum.
ja: ファイルオブジェクトは、RawWrite/RawReadまたはWriteNum/ReadNumによるバイナリI/Oもサポートしています。

source: File objects internally buffer reads or writes.
ja: ファイルオブジェクトは、内部的に読み書きをバッファリングします。

source: File patterns longer than 259 characters are supported only when at least one of the following is true:
ja: 259文字より長いファイルパターンは、以下のうち少なくとも1つが成立している場合にのみサポートされます：

source: FileAppend "`n" IB.Value, A_ScriptFullPath ; Save the hotstring for later use.
ja: FileAppend "`n" IB.Value, A_ScriptFullPath ; 後で使うためにホットストリングを保存します。

source: FileAppend - Syntax & Usage | AutoHotkey v2
ja: FileAppend - 構文と使用法｜AutoHotkey v2

source: FileAppend and FileRead both have a separate Options parameter which replaces the option prefixes and may include an optional encoding name (superseding FileRead's *Pnnn option).
ja: FileAppendとFileReadは、オプションの接頭辞を置き換える別のOptionsパラメータを持ち、オプションのエンコーディング名（FileReadの*Pnnnオプションに取って代わる）を含めることができます。

source: FileAppend and FileRead support an option "RAW" to disable codepage conversion (read/write binary data); FileRead returns a Buffer object in this case.
ja: FileAppendとFileReadは、コードページ変換（バイナリデータの読み書き）を無効にするオプション"RAW"をサポートしています。FileReadはこの場合、Bufferオブジェクトを返す。

source: FileAppend may accept a Buffer-like object, in which case no conversions are performed.
ja: FileAppend はBuffer-likeオブジェクトを受け取ることができ、その場合、変換は行われません。

source: FileAppend(MainEdit.Value, FileName) ; Save the contents to the file.
ja: FileAppend(MainEdit.Value, FileName) ; 内容をファイルに保存します。

source: FileAppend, FileRead and FileOpen use "`n" to enable end-of-line translations.
ja: FileAppend、FileRead、FileOpenは、行末変換を有効にするために"`n"を使用します。

source: FileContent := FileRead(FileName) ; Read the file's contents into the variable.
ja: FileContent := FileRead(FileName) ; ファイルの中身を変数に読み込みます。

source: FileCopy - Syntax & Usage | AutoHotkey v2
ja: FileCopy - 構文と使用法｜AutoHotkey v2

source: FileCopy A_LoopFilePath, Dest "\" A_LoopFileName, 1 ; Copy with overwrite=yes
ja: FileCopy A_LoopFilePath, Dest "\" A_LoopFileName, 1 ; 上書きコピー(Yes)

source: FileCopy copies files only.
ja: FileCopyは、ファイルのみをコピーします。

source: FileCreateShortcut - Syntax & Usage | AutoHotkey v2
ja: FileCreateShortcut - 構文と使用法｜AutoHotkey v2

source: FileDelete - Syntax & Usage | AutoHotkey v2
ja: FileDelete - 構文と使用法｜AutoHotkey v2

source: FileDelete FTPCommandFile ; Delete for security reasons.
ja: FileDelete FTPCommandFile ; セキュリティ上、削除してください。

source: FileDir := LV.GetText(FocusedRowNumber, 2) ; Get the text of the second field.
ja: FileDir := LV.GetText(FocusedRowNumber, 2) ; 2番目のフィールドのテキストを取得します。

source: FileDir := LV.GetText(Item, 2) ; Get the text of the second field.
ja: FileDir := LV.GetText(Item, 2) ; 2番目のフィールドのテキストを取得します。

source: FileDir := LV.GetText(RowNumber, 2) ; Get the text of the second field.
ja: FileDir := LV.GetText(RowNumber, 2) ; 2番目のフィールドのテキストを取得します。

source: FileEncoding - Syntax & Usage | AutoHotkey v2
ja: FileEncoding - 構文と使用法｜AutoHotkey v2

source: FileExist - Syntax & Usage | AutoHotkey v2
ja: FileExist - 構文と使用法｜AutoHotkey v2

source: FileGetAttrib - Syntax & Usage | AutoHotkey v2
ja: FileGetAttrib - 構文と使用法｜AutoHotkey v2

source: FileGetShortcut - Syntax & Usage | AutoHotkey v2
ja: FileGetShortcut - 構文と使用法｜AutoHotkey v2

source: FileGetSize - Syntax & Usage | AutoHotkey v2
ja: FileGetSize - 構文と使用法｜AutoHotkey v2

source: FileGetTime - Syntax & Usage | AutoHotkey v2
ja: FileGetTime - 構文と使用法｜AutoHotkey v2

source: FileGetVersion - Syntax & Usage | AutoHotkey v2
ja: FileGetVersion - 構文と使用法｜AutoHotkey v2

source: FileInstall - Syntax & Usage | AutoHotkey v2
ja: FileInstall - 構文と使用法｜AutoHotkey v2

source: FileItem := StrSplit(A_LoopField, A_Tab) ; Split into two parts at the tab char.
ja: FileItem := StrSplit(A_LoopField, A_Tab) ; タブ文字で2つに分割します。

source: FileList := "" ; Initialize to be blank.
ja: FileList := "" ; 空白になるように初期化します。

source: FileList := Sort(FileList, "R") ; The R option sorts in reverse order. See Sort for other options.
ja: FileList := Sort(FileList, "R") ; Rオプションは逆順にソートします。他のオプションはSortを参照。

source: FileMenu.Add "&Open`tCtrl+O", (*) => FileSelect() ; See remarks below about Ctrl+O.
ja: FileMenu.Add "&Open`tCtrl+O", (*) => FileSelect() ; Ctrl+Oについては後述します。

source: FileMenu.Add("&Open`tCtrl+O", (*) => FileSelect()) ; See remarks below about Ctrl+O.
ja: FileMenu.Add("&Open`tCtrl+O", (*) => FileSelect()) ; Ctrl+Oについては下記参照。

source: FileMenu.Add() ; Separator line.
ja: FileMenu.Add() ; 区切り線です。

source: FileMenu.Disable("3&") ; Gray out &Save.
ja: FileMenu.Disable("3&") ; グレイアウトと保存.

source: FileMenu.Enable("3&") ; Re-enable &Save.
ja: FileMenu.Enable("3&") ; 再度有効化および保存。

source: FileMove - Syntax & Usage | AutoHotkey v2
ja: FileMove - 構文と使用法｜AutoHotkey v2

source: FileMove moves files only.
ja: FileMoveは、ファイルのみを移動します。

source: FileName := A_LoopFilePath ; Must save it to a writable variable for use below.
ja: FileName := A_LoopFilePath ; 書き込み可能な変数に保存し、以下で使用する必要があります。

source: FileName := LV.GetText(FocusedRowNumber, 1) ; Get the text of the first field.
ja: FileName := LV.GetText(FocusedRowNumber, 1) ; 最初のフィールドのテキストを取得します。

source: FileName := LV.GetText(Item, 1) ; Get the text of the first field.
ja: FileName := LV.GetText(Item, 1) ; 最初のフィールドのテキストを取得します。

source: FileName := LV.GetText(RowNumber, 1) ; Get the text of the first field.
ja: FileName := LV.GetText(RowNumber, 1) ; 最初のフィールドのテキストを取得します。

source: FileObj := FileOpen(FileName, "r-d") ; read the file ("r"), share all access except for delete ("-d")
ja: FileObj := FileOpen(FileName, "r-d") ; ファイルを読み込み（r）は、削除（-d）を除くすべてのアクセスを共有します。

source: FileOpen - Syntax & Usage | AutoHotkey v2
ja: FileOpen - 構文と使用法｜AutoHotkey v2

source: FileOpen("*", "r") ; for stdin
ja: FileOpen("*", "r") ; 標準入力用

source: FileOpen("*", "w") ; for stdout
ja: FileOpen("*", "w") ; 標準出力用

source: FileOpen("**", "w") ; for stderr
ja: FileOpen("**", "w") ; 標準エラー用

source: FileRead - Syntax & Usage | AutoHotkey v2
ja: FileRead - 構文と使用法｜AutoHotkey v2

source: FileRead may return corrupt binary data
ja: FileReadが破損したバイナリデータを返すことがある

source: FileReadLine (use a file-reading loop or FileOpen)
ja: FileReadLine（ファイル読み込みループまたはFileOpenを使用します）

source: FileRecycle - Syntax & Usage | AutoHotkey v2
ja: FileRecycle - 構文と使用法｜AutoHotkey v2

source: FileRecycleEmpty - Syntax & Usage | AutoHotkey v2
ja: FileRecycleEmpty - 構文と使用法｜AutoHotkey v2

source: FileSelect - Syntax & Usage | AutoHotkey v2
ja: FileSelect - 構文と使用法｜AutoHotkey v2

source: FileSelect can now be used in "Select Folder" mode via the D option letter.
ja: Dオプション文字による「フォルダ選択」モードでFileSelectを使用できるようになりました。

source: FileSelect no longer has a redundant "Text Documents (*.txt)" filter by default when Filter is omitted.
ja: Filterが省略された場合、FileSelectはデフォルトで「Text Documents (*.txt)」という冗長なフィルターを持たないようになりました。

source: FileSelect no longer strips spaces from the filter pattern, such as for pattern with spaces*.ext.
ja: FileSelectで、pattern with spaces*.extのようなフィルターパターンからスペースを取り除かなくなりました。

source: FileSelect now returns an Array of paths when the multi-select mode is used, instead of a string like C:\Dir`nFile1`nFile2.
ja: FileSelectでマルチセレクトモードを使用した場合、C:\Dir`nFile1`nFile2のような文字列ではなく、パスのArrayを返すようになりました。

source: FileSelect now uses the IFileDialog API present in Windows Vista and later, instead of the old GetOpenFileName/GetSaveFileName API.
ja: FileSelectは、従来のGetOpenFileName/GetSaveFileName APIに代わり、Windows Vista以降に存在するIFileDialog APIを使用するようになりました。

source: FileSelectFile (now named FileSelect) had two multi-select modes, accessible via options 4 and M. Option 4 and the corresponding mode have been removed; they had been undocumented for some time.
ja: FileSelectFile（現在はFileSelectという名前）には、オプション4とMでアクセスできる2つのマルチセレクトモードがありました。オプション4と対応するモードは削除され、しばらくは文書化されていませんでした。

source: FileSetAttrib "+RH", "C:\MyFiles\*.*", "DF" ; +RH is identical to +R+H
ja: FileSetAttrib "+RH", "C:\MyFiles\*.*", "DF" ; +RHは、+R+Hと同じです。

source: FileSetAttrib - Syntax & Usage | AutoHotkey v2
ja: FileSetAttrib - 構文と使用法｜AutoHotkey v2

source: FileSetTime - Syntax & Usage | AutoHotkey v2
ja: FileSetTime - 構文と使用法｜AutoHotkey v2

source: Files (such as those copied from an open Explorer window via Ctrl+C) are considered to be text:
ja: ファイル（Ctrl+Cで開いたエクスプローラーウィンドウからコピーしたものなど）はテキストとみなされます。

source: Files (such as those copied from an open Explorer window via Ctrl+C) are considered to be text: They are automatically converted to their filenames (with full path) whenever A_Clipboard is referenced in the script.
ja: ファイル（Ctrl+Cで開いたエクスプローラーウィンドウからコピーしたものなど）はテキストとみなされます。スクリプト内でA_Clipboardが参照されるたびに、それらは自動的にファイル名（フルパス付き）に変換されます。

source: Files added to a script are neither compressed nor encrypted during compilation, but the compiled script EXE can be compressed by using the appropriate option in Ahk2Exe.
ja: スクリプトに追加されたファイルは、コンパイル時に圧縮も暗号化もされませんが、コンパイルされたスクリプトEXEは、Ahk2Exeの適切なオプションを使用することで圧縮することができます。

source: Files in an NTFS file system are probably always retrieved in alphabetical order.
ja: NTFSファイルシステム内のファイルは、おそらく常にアルファベット順に検索されます。

source: Files in other file systems are retrieved in no particular order.
ja: 他のファイルシステムのファイルは、順不同で検索されます。

source: Files larger than 4 gigabytes are also supported.
ja: 4ギガバイトを超えるファイルにも対応しています。

source: Files of any size are supported, even those over 4 gigabytes, and even if Units is bytes.
ja: 4ギガバイトを超えるファイルでも、Unitsがbyteでも、あらゆるサイズのファイルに対応しています。

source: Files/folders are dragged and dropped onto the window.
ja: ファイル/フォルダーをウィンドウにドラッグ＆ドロップします。

source: Finally - Syntax & Usage | AutoHotkey v2
ja: Finally - 構文と使用法｜AutoHotkey v2

source: Finally, FileOpen and File.RawRead or File.ReadNum may be used to read binary data without first reading the entire file into memory.
ja: 最後に、FileOpenとFile.RawReadまたはFile.ReadNumを使用すると、最初にファイル全体をメモリに読み込まずにバイナリデータを読み込むことができます。

source: Finally, parsing loops can operate on the individual fields contained inside a delimited string.
ja: 最後に、解析ループは、区切られた文字列の中に含まれる個々のフィールドを操作することができます。

source: Finally, AutoHotkey would not be what it is today without these other individuals.
ja: 最後に、AutoHotkeyは、このような他の人たちの存在なくしては、今日の姿はなかったでしょう。

source: Finally, a control's HWND can be used directly in a WinTitle parameter.
ja: 最後に、コントロールのHWNDをWinTitleパラメータで直接使用することができます。

source: Finally, any free program is threatened constantly by software patents.
ja: 最後に、どんなフリープログラムもソフトウェア特許によって常に脅かされている。

source: Finally, any hotkey with a wildcard prefix (*) is entirely separate from a non-wildcard one; for example, "*F1" and "F1" would each have their own set of variants.
ja: 最後に、ワイルドカード接頭辞(*)を持つホットキーは、ワイルドカードでないものと全く別物です。例えば、「*F1」と「F1」は、それぞれ独自のバリエーションを持つことになります。

source: Finally, each linefeed (`n) is translated to <br>`n (i.e. <br> followed by a linefeed).
ja: 最後に、各ラインフィード（`n）は、<br>`n（つまり<br>の後にラインフィードが続く）に変換される。

source: Finally, each script is quasi multi-threaded, which allows a new hotkey to be launched even when a previous hotkey subroutine is still running.
ja: 最後に、各スクリプトは準マルチスレッドであり、前のホットキーサブルーチンがまだ実行中であっても、新しいホットキーを起動することが可能です。

source: Finally, since mouse wheel hotkeys generate only down-events (never up-events), they cannot be used as key-up hotkeys.
ja: 最後に、マウスホイールのホットキーはダウンイベントのみを生成するため（アップイベントは生成しない）、キーアップホットキーとして使用することはできません。

source: Finally, the margin is taken into account by the first use of Gui.Show to calculate the window's size (when no explicit size is specified).
ja: 最後に、マージンはGui.Showの最初の使用でウィンドウのサイズを計算する際に考慮されます（サイズが明示的に指定されていない場合）。

source: Finally, the type of hotkey is also displayed, which is one of the following:
ja: 最後に、ホットキーの種類も表示され、以下のいずれかになります：

source: Finally, the word Expand may optionally be followed immediately by a 0 or 1 to indicate the starting state.
ja: 最後に、Expandの直後に、開始状態を示す0または1を続けることもできる。

source: Finally, there are several built-in date/time variables, as well as the FormatTime function to create a custom date/time string.
ja: 最後に、いくつかの組み込み日付/時刻変数と、カスタム日付/時刻文字列を作成するためのFormatTime関数があります。

source: Finally, this setting may be changed for an individual control by specifying +Theme or -Theme in its options when it is created.
ja: この設定は、コントロールの作成時にオプションで+Themeまたは-Themeを指定することで、個々のコントロールに対して変更することができます。

source: Finally, when passing a string-variable to a function that will not change the length of the string, performance is improved by passing the variable by address (e.g. StrPtr(MyVar)) rather than as a "str" (especially when the string is very long).
ja: 最後に、文字列の長さを変えない関数に文字列変数を渡す場合、変数を「str」としてではなく、アドレスで渡す（例：StrPtr(MyVar)）ことでパフォーマンスが向上します（特に文字列が非常に長い場合）。

source: Finally, your productivity may be improved by using an auto-completion utility like the script by boiler or the script by Helgef, which works in almost any editor.
ja: 最後に、boilerのスクリプトや Helgefのスクリプトのように、ほとんどのエディタで動作する自動補完ユーティリティを使用すると、生産性が向上する可能性があります。

source: Find "New" in the menu.
ja: メニューから「新規作成」を見つけてください。

source: Find the newly created file on your desktop and right-click it.
ja: デスクトップ上に新しく作成されたファイルを見つけて右クリックします。

source: Find the script file, select it, and press Ctrl+C.
ja: スクリプトファイルを探し、選択し、Ctrl+Cを押します。

source: Finding your AHK version
ja: AHKバージョンの検索

source: Finds the process ID of an AHK script (an alternative to WinGetPID).
ja: AHKスクリプトのプロセスIDを検索します（WinGetPIDの代わりとなるもの）。

source: Fire the hotkey even if extra modifiers are being held down.
ja: 余分なモディファイアが押されていても、ホットキーを発射します。

source: Firewalls or the presence of multiple network adapters may cause this function to fail.
ja: ファイアウォールや複数のネットワークアダプターが存在する場合、この機能に失敗することがあります。

source: First, here is an example that closes another script:
ja: まず、別のスクリプトを閉じる例を紹介します：

source: Firstly, the obvious:
ja: まず、当たり前のことですが。

source: Fixed #Requires not being detected if followed by a comment other than ; prefer xxx.
ja: #Requires の後に; prefer xxx以外のコメントが続くと、#Requiresが検出されない問題を修正しました。

source: Fixed #include <> error messages to show "Script library" rather than "Function library".
ja: #include<>のエラーメッセージが「関数ライブラリ」ではなく「スクリプトライブラリ」と表示されるように修正しました。

source: Fixed (non-string) file version number for AutoHotkey binaries.
ja: AutoHotkeyバイナリの非文字列のファイルバージョン番号を修正しました。

source: Fixed <base> debugger pseudo-property leaking a reference (since v2.0.14).
ja: v2.0.14以降、<base>デバッガの擬似プロパティが参照をリークする問題を修正しました。

source: Fixed +BackgroundDefault failing to override the Gui's BackColor property.
ja: +BackgroundDefaultがGuiのBackColorプロパティをオーバライドできない不具合を修正しました。

source: Fixed :B0*O:XY::Z to produce XYZ rather than XZ (suppressing Y).
ja: ホットストリング:B0*O:XY::Zが、XZではなく正しくXYZと出力されるように修正しました。

source: Fixed Hotkey("a", "b") to use the original function of "b", not "a".
ja: Hotkey("a", "b")が「a」ではなく、「b」の本来の機能を使うように修正。

source: Fixed ListView.Opt("NoSort").
ja: ListView.Opt("NoSort")を修正しました。

source: Fixed VerCompare(a, ">" b) and reduced code size marginally.
ja: VerCompare(a, ">" b)を修正し、コードサイズをわずかに縮小させました。
